; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob83) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - pallet
	crate0 crate1 crate2 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot0)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate1)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 depot1)
	(clear crate2)
	(at pallet10 distributor1)
	(clear crate0)
	(at truck0 distributor2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 419)
	(at truck1 depot1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 357)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 distributor0)
	(available hoist11)
	(at crate0 distributor1)
	(on crate0 pallet10)
	(= (weight crate0) 53)
	(at crate1 distributor2)
	(on crate1 pallet7)
	(= (weight crate1) 61)
	(at crate2 depot1)
	(on crate2 pallet9)
	(= (weight crate2) 49)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet7)
		(on crate2 pallet8)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist4 crate0 pallet10 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet10)
   added: (lifting hoist4 crate0) (clear pallet10)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 3
2. (lift hoist1 crate2 pallet9 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet9)
   added: (lifting hoist1 crate2) (clear pallet9)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 3
3. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 3
4. (load hoist4 crate0 truck0 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck0) (available hoist4)
   changed: (current_load truck0) from 0 to 53
   goals met: 1 of 3
5. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 3
6. (load hoist1 crate2 truck1 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 49
   goals met: 1 of 3
7. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 22 to 32
   goals met: 1 of 3
8. (unload hoist2 crate0 truck0 depot2)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 53 to 0
   goals met: 1 of 3
9. (unload hoist5 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist5)
   added: (lifting hoist5 crate2)
   changed: (current_load truck1) from 49 to 0
   goals met: 1 of 3
10. (drop hoist2 crate0 pallet2 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (available hoist2) (at crate0 depot2) (clear crate0) (on crate0 pallet2)
   goals met: 2 of 3
11. (drop hoist5 crate2 pallet8 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet8)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet8)
   goals met: 3 of 3
